#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws02/runs/run-8kTs9yh8u2aDVbup

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.ansible.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:531133914787:cluster/ansibledocker]
module.ansible.aws_ecr_repository_policy.policy: Refreshing state... [id=ansibledocker]
module.ansible.aws_ecr_lifecycle_policy.lifecycle: Refreshing state... [id=ansibledocker]
module.ansible.aws_iam_role.role: Refreshing state... [id=ansibledocker_ECSTaskRole]
module.ansible.aws_ecs_task_definition.task: Refreshing state... [id=ansibledocker]
module.ansible.aws_ecr_repository.repository: Refreshing state... [id=ansibledocker]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ansible.aws_ecr_repository.repository has changed
  ~ resource "aws_ecr_repository" "repository" {
        id                   = "ansibledocker"
        name                 = "ansibledocker"
      + tags                 = {}
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.ansible.aws_ecs_cluster.cluster has changed
  ~ resource "aws_ecs_cluster" "cluster" {
        id                 = "arn:aws:ecs:us-east-1:531133914787:cluster/ansibledocker"
        name               = "ansibledocker"
      + tags               = {}
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ansible.aws_ecs_task_definition.task has changed
  ~ resource "aws_ecs_task_definition" "task" {
        id                       = "ansibledocker"
      + tags                     = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ansible.aws_iam_role.role has changed
  ~ resource "aws_iam_role" "role" {
        id                    = "ansibledocker_ECSTaskRole"
        name                  = "ansibledocker_ECSTaskRole"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ansible.aws_ecr_lifecycle_policy.lifecycle will be destroyed
  # (because aws_ecr_lifecycle_policy.lifecycle is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "lifecycle" {
      - id          = "ansibledocker" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Expire untagged images after 1 day"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber = 1
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "531133914787" -> null
      - repository  = "ansibledocker" -> null
    }

  # module.ansible.aws_ecr_repository.repository will be destroyed
  # (because aws_ecr_repository.repository is not in configuration)
  - resource "aws_ecr_repository" "repository" {
      - arn                  = "arn:aws:ecr:us-east-1:531133914787:repository/ansibledocker" -> null
      - id                   = "ansibledocker" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "ansibledocker" -> null
      - registry_id          = "531133914787" -> null
      - repository_url       = "531133914787.dkr.ecr.us-east-1.amazonaws.com/ansibledocker" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # module.ansible.aws_ecr_repository_policy.policy will be destroyed
  # (because aws_ecr_repository_policy.policy is not in configuration)
  - resource "aws_ecr_repository_policy" "policy" {
      - id          = "ansibledocker" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:UploadLayerPart",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:DescribeRepositories",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:ListImages",
                          - "ecr:DeleteRepository",
                          - "ecr:BatchDeleteImage",
                          - "ecr:SetRepositoryPolicy",
                          - "ecr:DeleteRepositoryPolicy",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - registry_id = "531133914787" -> null
      - repository  = "ansibledocker" -> null
    }

  # module.ansible.aws_ecs_cluster.cluster will be destroyed
  # (because aws_ecs_cluster.cluster is not in configuration)
  - resource "aws_ecs_cluster" "cluster" {
      - arn                = "arn:aws:ecs:us-east-1:531133914787:cluster/ansibledocker" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:us-east-1:531133914787:cluster/ansibledocker" -> null
      - name               = "ansibledocker" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # module.ansible.aws_ecs_task_definition.task will be destroyed
  # (because aws_ecs_task_definition.task is not in configuration)
  - resource "aws_ecs_task_definition" "task" {
      - arn                      = "arn:aws:ecs:us-east-1:531133914787:task-definition/ansibledocker:1" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "531133914787.dkr.ecr.us-east-1.amazonaws.com/ansibledocker:latest"
                  - mountPoints      = []
                  - name             = "ansibledocker"
                  - portMappings     = []
                  - volumesFrom      = []
                  - workingDirectory = "/var/ansibledocker"
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::531133914787:role/ansibledocker_ECSTaskRole" -> null
      - family                   = "ansibledocker" -> null
      - id                       = "ansibledocker" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 1 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null

      - runtime_platform {
          - cpu_architecture        = "X86_64" -> null
          - operating_system_family = "LINUX" -> null
        }
    }

  # module.ansible.aws_iam_role.role will be destroyed
  # (because aws_iam_role.role is not in configuration)
  - resource "aws_iam_role" "role" {
      - arn                   = "arn:aws:iam::531133914787:role/ansibledocker_ECSTaskRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "ECSTaskExecution"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-03-22T05:01:20Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ansibledocker_ECSTaskRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ansibledocker_ECSTaskRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXXKQML2RXTQPWCTLA" -> null

      - inline_policy {}
    }

  # module.ansiblecontainer.aws_ecr_lifecycle_policy.lifecycle will be created
  + resource "aws_ecr_lifecycle_policy" "lifecycle" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images after 1 day"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "ansibledocker"
    }

  # module.ansiblecontainer.aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ansibledocker"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.ansiblecontainer.aws_ecr_repository_policy.policy will be created
  + resource "aws_ecr_repository_policy" "policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                          + "ecr:DeleteRepository",
                          + "ecr:BatchDeleteImage",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:DeleteRepositoryPolicy",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "ansibledocker"
    }

  # module.ansiblecontainer.aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "ansibledocker"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.ansiblecontainer.aws_ecs_task_definition.task will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "ansibledocker"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ansiblecontainer.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecution"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ]
      + max_session_duration  = 3600
      + name                  = "ansibledocker_ECSTaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 6 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*